imbluedabr/m33mu/cpu/nrf5340/nrf5340_cryptocell.c
/* m33mu -- an ARMv8-M Emulator
 *
 * SPDX-License-Identifier: AGPL-3.0-or-later
 *
 * Arm CryptoCell-312 MMIO peripheral model for nRF5340.
 *
 * See nrf5340_cryptocell.h for the register layout and design rationale.
 *
 * Operation model
 * ---------------
 * The real CC-312 uses a DMA-driven pipeline:
 *   1. Write AES key/IV (or HASH mode/initial state).
 *   2. Program AES_CONTROL / HASH_CONTROL.
 *   3. Write SRC_MEM_ADDR (input data pointer in target address space).
 *   4. Write DST_MEM_ADDR (output pointer for AES; HASH result in HASH_H[]).
 *   5. Write SRC_MEM_SIZE (triggers DMA + operation).
 *   6. Poll IRR.HASH_DONE or IRR.AES_DONE (or wait for IRQ 68).
 *   7. For AES: read DST (already written to target RAM).
 *      For SHA-256: read HASH_H[0..7].
 *
 * We trigger the operation synchronously on the SRC_MEM_SIZE write.
 * The result is placed in target RAM (AES) or in HASH_H[] (SHA-256)
 * before the write returns.
 *
 * AES_CONTROL bits (per CC-312 / nrf5340_application.h):
 *   [2:0] mode: 0=ECB, 1=CBC, 3=CTR
 *   [3]   direction: 0=encrypt, 1=decrypt
 *   [5:4] key size: 0=128, 1=192, 2=256
 *
 * HASH_CONTROL bits:
 *   [3:0] mode: 1=MD5, 2=SHA-1, 3=SHA-256, 5=SHA-384, 6=SHA-512
 *
 * IRR bits (HOST_RGF IRR at engine-base + 0xA00):
 *   [0]  AXIM_COMP (AXI master completion — we use it as generic "done")
 *   [1]  AES_COMPLETE
 *   [2]  HASH_COMPLETE
 *   [8]  CONFIG_COMPLETE
 *   [9]  ERROR
 *
 * TODO: align with real CC-312 nrfx driver for complete silicon fidelity.
 */

#include <stdlib.h>
#include <string.h>
#include <stdio.h>

#include "nrf5340_cryptocell.h"
#include "../mm_host_crypto.h"
#include "m33mu/nvic.h"
#include "m33mu/memmap.h"
#include "m33mu/cpu.h"   /* for MM_SECURE */

/* -------------------------------------------------------------------------
 * CRYPTOCELL_IRQn
 * Per nrf5340_application.h: CRYPTOCELL_IRQn = 68
 * ------------------------------------------------------------------------- */
#define CRYPTOCELL_IRQn    68u

/* -------------------------------------------------------------------------
 * Engine region (base = 0x50845000) register offsets
 * ------------------------------------------------------------------------- */

/* AES sub-block */
#define AES_KEY_0_OFF      0x400u  /* 8 words (32 bytes) */
#define AES_KEY_1_OFF      0x420u  /* 8 words — not used in this model */
#define AES_IV_0_OFF       0x440u  /* 4 words (16 bytes) */
#define AES_IV_1_OFF       0x450u  /* not used */
#define AES_CTR_OFF        0x460u  /* not used */
#define AES_BUSY_OFF       0x470u
#define AES_REMAINING_OFF  0x4BCu
#define AES_CONTROL_OFF    0x4C0u
#define AES_HW_FLAGS_OFF   0x4C8u
#define AES_SW_RESET_OFF   0x4F4u

/* HASH sub-block */
#define HASH_H_OFF         0x640u  /* 8 words (32 bytes) */
#define HASH_PAD_AUTO_OFF  0x684u
#define HASH_XOR_DIN_OFF   0x688u
#define HASH_INIT_STATE_OFF 0x694u
#define HASH_SELECT_OFF    0x6A4u
#define HASH_CONTROL_OFF   0x7C0u
#define HASH_PAD_OFF       0x7C4u
#define HASH_PAD_FORCE_OFF 0x7C8u
#define HASH_CUR_LEN_0_OFF 0x7CCu
#define HASH_CUR_LEN_1_OFF 0x7D0u
#define HASH_HW_FLAGS_OFF  0x7DCu
#define HASH_SW_RESET_OFF  0x7E4u
#define HASH_ENDIAN_OFF    0x7E8u

/* CTL sub-block */
#define CTL_CRYPTO_CTL_OFF 0x900u
#define CTL_CRYPTO_BUSY_OFF 0x910u
#define CTL_HASH_BUSY_OFF  0x91Cu
#define CTL_CONTEXT_ID_OFF 0x930u

/* DIN sub-block */
#define DIN_BUFFER_OFF     0xC00u
#define DIN_DMA_MEM_BUSY_OFF 0xC20u
#define DIN_SRC_MEM_ADDR_OFF 0xC28u
#define DIN_SRC_MEM_SIZE_OFF 0xC2Cu  /* write triggers DMA */
#define DIN_DIN_FIFO_EMPTY_OFF 0xC50u
#define DIN_SW_RESET_OFF   0xC44u

/* DOUT sub-block */
#define DOUT_BUFFER_OFF    0xD00u
#define DOUT_DMA_MEM_BUSY_OFF 0xD20u
#define DOUT_DST_MEM_ADDR_OFF 0xD28u
#define DOUT_DST_MEM_SIZE_OFF 0xD2Cu
#define DOUT_DOUT_FIFO_EMPTY_OFF 0xD50u
#define DOUT_SW_RESET_OFF  0xD58u

/* HOST_RGF sub-block */
#define HOST_IRR_OFF       0xA00u
#define HOST_IMR_OFF       0xA04u
#define HOST_ICR_OFF       0xA08u
#define HOST_ENDIAN_OFF    0xA0Cu
#define HOST_SIGNATURE_OFF 0xA24u
#define HOST_BOOT_OFF      0xA28u
#define HOST_CC_IS_IDLE_OFF 0xA7Cu
#define HOST_POWERDOWN_OFF  0xA80u

/* Size of the engine register region we expose */
#define CC_ENGINE_SIZE     0x2000u

/* CRYPTOCELL control region (0x50844000) size */
#define CC_CTRL_SIZE       0x1000u
#define CC_CTRL_ENABLE_OFF 0x500u

/* IRR / ICR bits */
#define IRR_AXIM_COMP      (1u << 0)
#define IRR_AES_COMPLETE   (1u << 1)
#define IRR_HASH_COMPLETE  (1u << 2)
#define IRR_CONFIG_COMPLETE (1u << 8)
#define IRR_ERROR          (1u << 9)

/* AES_CONTROL bits */
#define AES_CTRL_MODE_MASK  0x07u
#define AES_CTRL_MODE_ECB   0u
#define AES_CTRL_MODE_CBC   1u
#define AES_CTRL_MODE_CTR   3u
#define AES_CTRL_DECRYPT    (1u << 3)
#define AES_CTRL_KEYSZ_MASK (0x3u << 4)
#define AES_CTRL_KEYSZ_128  (0u << 4)
#define AES_CTRL_KEYSZ_192  (1u << 4)
#define AES_CTRL_KEYSZ_256  (2u << 4)

/* HASH_CONTROL mode values */
#define HASH_MODE_SHA256    3u
#define HASH_MODE_SHA384    5u
#define HASH_MODE_SHA512    6u

/* -------------------------------------------------------------------------
 * Peripheral state
 * ------------------------------------------------------------------------- */

/* Maximum key size (AES-256 = 32 bytes = 8 words) */
#define CC_AES_KEY_WORDS  8u
#define CC_AES_IV_WORDS   4u
#define CC_HASH_H_WORDS   8u

struct mm_nrf5340_cryptocell {
    /* NVIC + memmap back-pointers */
    struct mm_nvic   *nvic;
    struct mm_memmap *map;

    /* CRYPTOCELL control region */
    mm_u32 ctrl_enable;

    /* AES registers */
    mm_u32 aes_key[CC_AES_KEY_WORDS];    /* AES_KEY_0[0..7] */
    mm_u32 aes_iv[CC_AES_IV_WORDS];      /* AES_IV_0[0..3] */
    mm_u32 aes_remaining;
    mm_u32 aes_control;

    /* HASH registers */
    mm_u32 hash_h[CC_HASH_H_WORDS];      /* result / init state */
    mm_u32 hash_control;
    mm_u32 hash_pad;
    mm_u32 hash_pad_auto;
    mm_u32 hash_init_state;
    mm_u32 hash_cur_len[2];

    /* CTL registers */
    mm_u32 crypto_ctl;

    /* DIN/DOUT */
    mm_u32 din_src_addr;
    mm_u32 din_src_size;
    mm_u32 dout_dst_addr;
    mm_u32 dout_dst_size;

    /* HOST_RGF interrupt registers */
    mm_u32 irr;      /* interrupt request register (R/O; cleared via ICR) */
    mm_u32 imr;      /* interrupt mask (0 bit = unmasked) */
    mm_u32 endianness;

    /* General-purpose staging regs (context ID, etc.) */
    mm_u32 context_id;
};

/* -------------------------------------------------------------------------
 * Lifecycle
 * ------------------------------------------------------------------------- */

struct mm_nrf5340_cryptocell *mm_nrf5340_cryptocell_new(void)
{
    struct mm_nrf5340_cryptocell *cc;
    cc = (struct mm_nrf5340_cryptocell *)calloc(1, sizeof(*cc));
    return cc;
}

void mm_nrf5340_cryptocell_reset(struct mm_nrf5340_cryptocell *cc)
{
    struct mm_nvic   *nvic_save;
    struct mm_memmap *map_save;
    if (cc == NULL) return;
    nvic_save = cc->nvic;
    map_save  = cc->map;
    memset(cc, 0, sizeof(*cc));
    cc->nvic = nvic_save;
    cc->map  = map_save;
    /* IMR reset: all interrupts masked by default (1 = masked per CC-312 spec) */
    cc->imr = 0xFFFFFFFFu;
}

void mm_nrf5340_cryptocell_free(struct mm_nrf5340_cryptocell *cc)
{
    free(cc);
}

void mm_nrf5340_cryptocell_set_nvic(struct mm_nrf5340_cryptocell *cc,
                                    struct mm_nvic *nvic)
{
    if (cc != NULL) cc->nvic = nvic;
}

void mm_nrf5340_cryptocell_set_memmap(struct mm_nrf5340_cryptocell *cc,
                                      struct mm_memmap *map)
{
    if (cc != NULL) cc->map = map;
}

/* -------------------------------------------------------------------------
 * IRQ delivery helper
 * Interrupt fires when the corresponding bit in IRR is 1 AND the same bit
 * in IMR is 0 (unmasked).
 * ------------------------------------------------------------------------- */
static void cc_maybe_irq(struct mm_nrf5340_cryptocell *cc)
{
    if (cc->nvic == NULL) return;
    if ((cc->irr & ~cc->imr) != 0u) {
        mm_nvic_set_pending(cc->nvic, CRYPTOCELL_IRQn, MM_TRUE);
    }
}

/* -------------------------------------------------------------------------
 * Helper: read N bytes from target address space into a local buffer.
 * Returns MM_FALSE if any byte fails.
 * ------------------------------------------------------------------------- */
static mm_bool cc_read_mem(struct mm_nrf5340_cryptocell *cc,
                           mm_u32 addr, mm_u8 *out, mm_u32 len)
{
    mm_u32 i;
    mm_u32 val;
    mm_u32 aligned;
    mm_u32 off;

