imbluedabr/m33mu/cpu/nrf5340/nrf5340_cryptocell.c
    if (cc->map == NULL || out == NULL) return MM_FALSE;

    /* Word-aligned path */
    if ((addr & 3u) == 0u && (len & 3u) == 0u) {
        for (i = 0u; i < len; i += 4u) {
            if (!mm_memmap_read(cc->map, MM_SECURE, addr + i, 4u, &val))
                return MM_FALSE;
            out[i]     = (mm_u8)(val & 0xffu);
            out[i + 1] = (mm_u8)((val >> 8)  & 0xffu);
            out[i + 2] = (mm_u8)((val >> 16) & 0xffu);
            out[i + 3] = (mm_u8)((val >> 24) & 0xffu);
        }
        return MM_TRUE;
    }

    /* Unaligned fallback: read byte by byte via 4-byte aligned reads */
    for (i = 0u; i < len; ++i) {
        aligned = (addr + i) & ~3u;
        off     = (addr + i) & 3u;
        if (!mm_memmap_read(cc->map, MM_SECURE, aligned, 4u, &val))
            return MM_FALSE;
        out[i] = (mm_u8)((val >> (off * 8u)) & 0xffu);
    }
    return MM_TRUE;
}

/* -------------------------------------------------------------------------
 * Helper: write N bytes to target address space.
 * ------------------------------------------------------------------------- */
static mm_bool cc_write_mem(struct mm_nrf5340_cryptocell *cc,
                            mm_u32 addr, const mm_u8 *src, mm_u32 len)
{
    mm_u32 i;
    mm_u32 val;

    if (cc->map == NULL || src == NULL) return MM_FALSE;

    /* Word-aligned path */
    if ((addr & 3u) == 0u && (len & 3u) == 0u) {
        for (i = 0u; i < len; i += 4u) {
            val = (mm_u32)src[i] |
                  ((mm_u32)src[i + 1] << 8) |
                  ((mm_u32)src[i + 2] << 16) |
                  ((mm_u32)src[i + 3] << 24);
            if (!mm_memmap_write(cc->map, MM_SECURE, addr + i, 4u, val))
                return MM_FALSE;
        }
        return MM_TRUE;
    }

    /* Unaligned: write word by word via RMW (simple byte-write via write8) */
    for (i = 0u; i < len; ++i) {
        if (!mm_memmap_write8(cc->map, MM_SECURE, addr + i, src[i]))
            return MM_FALSE;
    }
    return MM_TRUE;
}

/* -------------------------------------------------------------------------
 * Build AES key bytes from word array (words are little-endian as written
 * by firmware on an LE host).
 * ------------------------------------------------------------------------- */
static void cc_words_to_bytes(const mm_u32 *words, mm_u32 n_words, mm_u8 *out)
{
    mm_u32 i;
    for (i = 0u; i < n_words; ++i) {
        mm_u32 w = words[i];
        out[i * 4u]     = (mm_u8)(w & 0xffu);
        out[i * 4u + 1] = (mm_u8)((w >> 8) & 0xffu);
        out[i * 4u + 2] = (mm_u8)((w >> 16) & 0xffu);
        out[i * 4u + 3] = (mm_u8)((w >> 24) & 0xffu);
    }
}

/* -------------------------------------------------------------------------
 * Execute operation triggered by SRC_MEM_SIZE write.
 *
 * Determines the active operation from AES_CONTROL / HASH_CONTROL /
 * CRYPTO_CTL and dispatches to host-crypto helpers.
 * ------------------------------------------------------------------------- */
static void cc_execute(struct mm_nrf5340_cryptocell *cc, mm_u32 len)
{
    mm_u32 hash_mode;
    mm_u32 aes_mode;
    mm_bool decrypt;
    mm_u32 keysz;
    mm_u32 key_len;
    mm_u8  key_bytes[32];
    mm_u8  iv_bytes[16];
    mm_u8 *inbuf;
    mm_u8 *outbuf;
    mm_bool ok;
    mm_u32 i;
    mm_u32 w;

    if (len == 0u) {
        cc->irr |= IRR_ERROR;
        cc_maybe_irq(cc);
        return;
    }

    /*
     * Determine operation type from HASH_CONTROL mode.
     * If HASH_CONTROL.mode != 0, this is a HASH operation.
     * Otherwise it's an AES operation.
     *
     * CRYPTO_CTL selects: bit[2:0] = 0 -> HASH, bit[2:0] = 1 -> AES.
     * (simplified: if HASH_CONTROL != 0, do hash; else do AES)
     */
    hash_mode = cc->hash_control & 0xFu;

    if (hash_mode != 0u) {
        /* ---- HASH operation ---- */
        if (hash_mode != HASH_MODE_SHA256) {
            /* Only SHA-256 is implemented. */
            fprintf(stderr, "[CC312] HASH mode %u not implemented (TODO)\n",
                    hash_mode);
            cc->irr |= IRR_ERROR;
            cc_maybe_irq(cc);
            return;
        }

        inbuf = (mm_u8 *)malloc(len);
        if (inbuf == NULL) {
            cc->irr |= IRR_ERROR;
            cc_maybe_irq(cc);
            return;
        }

        if (!cc_read_mem(cc, cc->din_src_addr, inbuf, len)) {
            free(inbuf);
            cc->irr |= IRR_ERROR;
            cc_maybe_irq(cc);
            return;
        }

        {
            mm_u8 digest[32];
            ok = mm_host_sha256(inbuf, (size_t)len, digest);
            free(inbuf);

            if (!ok) {
                /* No wolfSSL — store zero digest so firmware doesn't hang */
                memset(digest, 0, sizeof(digest));
            }

            /* Store result in HASH_H[0..7] (big-endian words per CC-312 spec) */
            for (i = 0u; i < 8u; ++i) {
                w = ((mm_u32)digest[i * 4u]      << 24) |
                    ((mm_u32)digest[i * 4u + 1u] << 16) |
                    ((mm_u32)digest[i * 4u + 2u] << 8)  |
                    ((mm_u32)digest[i * 4u + 3u]);
                cc->hash_h[i] = w;
            }

            /* If DST_MEM_ADDR is set, also write the digest to target RAM */
            if (cc->dout_dst_addr != 0u) {
                cc_write_mem(cc, cc->dout_dst_addr, digest, 32u);
            }
        }

        cc->irr |= IRR_HASH_COMPLETE | IRR_AXIM_COMP;
        cc_maybe_irq(cc);
        return;
    }

    /* ---- AES operation ---- */
    aes_mode = cc->aes_control & AES_CTRL_MODE_MASK;
    if (aes_mode != AES_CTRL_MODE_CBC) {
        /* Only AES-CBC is implemented. */
        fprintf(stderr, "[CC312] AES mode %u not implemented (TODO)\n",
                aes_mode);
        cc->irr |= IRR_ERROR;
        cc_maybe_irq(cc);
        return;
    }

    /* Validate length is a multiple of 16 */
    if ((len & 0xFu) != 0u) {
        fprintf(stderr, "[CC312] AES CBC len %u not multiple of 16\n",
                (unsigned)len);
        cc->irr |= IRR_ERROR;
        cc_maybe_irq(cc);
        return;
    }

