imbluedabr/m33mu/cpu/nrf5340/nrf5340_cryptocell.c
    /* Determine key size */
    keysz = (cc->aes_control & AES_CTRL_KEYSZ_MASK) >> 4;
    switch (keysz) {
    case 1u:  key_len = 24u; break;
    case 2u:  key_len = 32u; break;
    default:  key_len = 16u; break;
    }

    decrypt = (cc->aes_control & AES_CTRL_DECRYPT) != 0u;

    /* Build key and IV byte arrays (LE word order) */
    cc_words_to_bytes(cc->aes_key, key_len / 4u, key_bytes);
    cc_words_to_bytes(cc->aes_iv,  CC_AES_IV_WORDS, iv_bytes);

    inbuf  = (mm_u8 *)malloc(len);
    outbuf = (mm_u8 *)malloc(len);
    if (inbuf == NULL || outbuf == NULL) {
        free(inbuf);
        free(outbuf);
        cc->irr |= IRR_ERROR;
        cc_maybe_irq(cc);
        return;
    }

    if (!cc_read_mem(cc, cc->din_src_addr, inbuf, len)) {
        free(inbuf);
        free(outbuf);
        cc->irr |= IRR_ERROR;
        cc_maybe_irq(cc);
        return;
    }

    if (decrypt) {
        ok = mm_host_aes_cbc_dec(key_bytes, (size_t)key_len,
                                 iv_bytes, inbuf, outbuf, (size_t)len);
    } else {
        ok = mm_host_aes_cbc_enc(key_bytes, (size_t)key_len,
                                 iv_bytes, inbuf, outbuf, (size_t)len);
    }

    if (!ok) {
        /* No wolfSSL - return zeroes so firmware doesn't deadlock */
        memset(outbuf, 0, len);
    }

    if (cc->dout_dst_addr != 0u) {
        cc_write_mem(cc, cc->dout_dst_addr, outbuf, len);
    }

    free(inbuf);
    free(outbuf);

    cc->irr |= IRR_AES_COMPLETE | IRR_AXIM_COMP;
    cc_maybe_irq(cc);
}

/* -------------------------------------------------------------------------
 * CRYPTOCELL control region MMIO (0x50844000, size 0x1000)
 * Only ENABLE @ 0x500 is interesting.
 * ------------------------------------------------------------------------- */

mm_bool mm_nrf5340_cryptocell_ctrl_read(void *opaque, mm_u32 offset,
                                        mm_u32 size_bytes, mm_u32 *value_out)
{
    struct mm_nrf5340_cryptocell *cc = (struct mm_nrf5340_cryptocell *)opaque;
    if (cc == NULL || value_out == NULL) return MM_FALSE;
    if (size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > CC_CTRL_SIZE) return MM_FALSE;

    if (offset == CC_CTRL_ENABLE_OFF && size_bytes == 4u) {
        *value_out = cc->ctrl_enable;
        return MM_TRUE;
    }
    *value_out = 0u;
    return MM_TRUE;
}

mm_bool mm_nrf5340_cryptocell_ctrl_write(void *opaque, mm_u32 offset,
                                         mm_u32 size_bytes, mm_u32 value)
{
    struct mm_nrf5340_cryptocell *cc = (struct mm_nrf5340_cryptocell *)opaque;
    if (cc == NULL) return MM_FALSE;
    if (size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > CC_CTRL_SIZE) return MM_FALSE;

    if (offset == CC_CTRL_ENABLE_OFF && size_bytes == 4u) {
        cc->ctrl_enable = value;
    }
    return MM_TRUE;
}

/* -------------------------------------------------------------------------
 * Engine region MMIO (0x50845000, size 0x2000)
 * ------------------------------------------------------------------------- */

mm_bool mm_nrf5340_cryptocell_read(void *opaque, mm_u32 offset,
                                   mm_u32 size_bytes, mm_u32 *value_out)
{
    struct mm_nrf5340_cryptocell *cc = (struct mm_nrf5340_cryptocell *)opaque;
    mm_u32 idx;

    if (cc == NULL || value_out == NULL) return MM_FALSE;
    if (size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > CC_ENGINE_SIZE) return MM_FALSE;

    /* Default: return 0 for unknown/unmodelled registers */
    *value_out = 0u;

    /* AES registers */
    if (offset >= AES_KEY_0_OFF && offset < AES_KEY_0_OFF + CC_AES_KEY_WORDS * 4u) {
        /* AES_KEY is write-only in real hardware; return 0 */
        return MM_TRUE;
    }
    if (offset >= AES_IV_0_OFF && offset < AES_IV_0_OFF + CC_AES_IV_WORDS * 4u) {
        idx = (offset - AES_IV_0_OFF) / 4u;
        *value_out = cc->aes_iv[idx];
        return MM_TRUE;
    }
    if (offset == AES_REMAINING_OFF) {
        *value_out = cc->aes_remaining;
        return MM_TRUE;
    }
    if (offset == AES_CONTROL_OFF) {
        *value_out = cc->aes_control;
        return MM_TRUE;
    }
    if (offset == AES_BUSY_OFF) {
        *value_out = 0u; /* always ready */
        return MM_TRUE;
    }
    if (offset == AES_HW_FLAGS_OFF) {
        *value_out = 0x00000001u; /* AES supported */
        return MM_TRUE;
    }

    /* HASH registers */
    if (offset >= HASH_H_OFF && offset < HASH_H_OFF + CC_HASH_H_WORDS * 4u) {
        idx = (offset - HASH_H_OFF) / 4u;
        *value_out = cc->hash_h[idx];
        return MM_TRUE;
    }
    if (offset == HASH_CONTROL_OFF) {
        *value_out = cc->hash_control;
        return MM_TRUE;
    }
    if (offset == HASH_PAD_OFF) {
        *value_out = cc->hash_pad;
        return MM_TRUE;
    }
    if (offset == HASH_PAD_AUTO_OFF) {
        *value_out = cc->hash_pad_auto;
        return MM_TRUE;
    }
    if (offset == HASH_CUR_LEN_0_OFF) {
        *value_out = cc->hash_cur_len[0];
        return MM_TRUE;
    }
    if (offset == HASH_CUR_LEN_1_OFF) {
        *value_out = cc->hash_cur_len[1];
        return MM_TRUE;
    }
    if (offset == HASH_HW_FLAGS_OFF) {
        *value_out = 0x00000004u; /* SHA-256 supported */
        return MM_TRUE;
    }

    /* CTL registers */
    if (offset == CTL_CRYPTO_CTL_OFF) {
        *value_out = cc->crypto_ctl;
        return MM_TRUE;
    }
    if (offset == CTL_CRYPTO_BUSY_OFF || offset == CTL_HASH_BUSY_OFF) {
        *value_out = 0u; /* always idle */
        return MM_TRUE;
    }
    if (offset == CTL_CONTEXT_ID_OFF) {
        *value_out = cc->context_id;
        return MM_TRUE;
    }

    /* DIN registers */
    if (offset == DIN_SRC_MEM_ADDR_OFF) {
        *value_out = cc->din_src_addr;
        return MM_TRUE;
    }
    if (offset == DIN_SRC_MEM_SIZE_OFF) {
        *value_out = cc->din_src_size;
        return MM_TRUE;
    }
    if (offset == DIN_DMA_MEM_BUSY_OFF) {
        *value_out = 0u;
        return MM_TRUE;
    }
    if (offset == DIN_DIN_FIFO_EMPTY_OFF) {
        *value_out = 1u; /* FIFO empty (ready) */
        return MM_TRUE;
    }

    /* DOUT registers */
    if (offset == DOUT_DST_MEM_ADDR_OFF) {
        *value_out = cc->dout_dst_addr;
        return MM_TRUE;
    }
    if (offset == DOUT_DST_MEM_SIZE_OFF) {
        *value_out = cc->dout_dst_size;
        return MM_TRUE;
    }
    if (offset == DOUT_DMA_MEM_BUSY_OFF) {
        *value_out = 0u;
        return MM_TRUE;
    }
    if (offset == DOUT_DOUT_FIFO_EMPTY_OFF) {
        *value_out = 1u;
        return MM_TRUE;
    }

    /* HOST_RGF registers */
    if (offset == HOST_IRR_OFF) {
        *value_out = cc->irr;
        return MM_TRUE;
    }
    if (offset == HOST_IMR_OFF) {
        *value_out = cc->imr;
        return MM_TRUE;
    }
    if (offset == HOST_ICR_OFF) {
        *value_out = 0u; /* write-only */
        return MM_TRUE;
    }
    if (offset == HOST_ENDIAN_OFF) {
        *value_out = cc->endianness;
        return MM_TRUE;
    }
    if (offset == HOST_SIGNATURE_OFF) {
        *value_out = 0xDCC63116u; /* CC-312 subsystem signature */
        return MM_TRUE;
    }
    if (offset == HOST_BOOT_OFF) {
        *value_out = 0x00000001u; /* AES supported in boot config */
        return MM_TRUE;
    }
    if (offset == HOST_CC_IS_IDLE_OFF) {
        *value_out = 1u; /* always idle */
        return MM_TRUE;
    }
    if (offset == HOST_POWERDOWN_OFF) {
        *value_out = 0u;
        return MM_TRUE;
    }

    return MM_TRUE; /* default 0 for unmapped */
}

mm_bool mm_nrf5340_cryptocell_write(void *opaque, mm_u32 offset,
                                    mm_u32 size_bytes, mm_u32 value)
{
    struct mm_nrf5340_cryptocell *cc = (struct mm_nrf5340_cryptocell *)opaque;
    mm_u32 idx;

