imbluedabr/m33mu/cpu/nrf5340/nrf5340_cryptocell.c
    if (cc == NULL) return MM_FALSE;
    if (size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > CC_ENGINE_SIZE) return MM_FALSE;

    /* AES registers */
    if (offset >= AES_KEY_0_OFF && offset < AES_KEY_0_OFF + CC_AES_KEY_WORDS * 4u
        && size_bytes == 4u) {
        idx = (offset - AES_KEY_0_OFF) / 4u;
        cc->aes_key[idx] = value;
        return MM_TRUE;
    }
    if (offset >= AES_IV_0_OFF && offset < AES_IV_0_OFF + CC_AES_IV_WORDS * 4u
        && size_bytes == 4u) {
        idx = (offset - AES_IV_0_OFF) / 4u;
        cc->aes_iv[idx] = value;
        return MM_TRUE;
    }
    if (offset == AES_REMAINING_OFF) {
        cc->aes_remaining = value;
        return MM_TRUE;
    }
    if (offset == AES_CONTROL_OFF) {
        cc->aes_control = value;
        return MM_TRUE;
    }
    if (offset == AES_SW_RESET_OFF) {
        /* Reset AES engine state */
        memset(cc->aes_key, 0, sizeof(cc->aes_key));
        memset(cc->aes_iv, 0, sizeof(cc->aes_iv));
        cc->aes_remaining = 0u;
        cc->aes_control = 0u;
        return MM_TRUE;
    }

    /* HASH registers */
    if (offset >= HASH_H_OFF && offset < HASH_H_OFF + CC_HASH_H_WORDS * 4u
        && size_bytes == 4u) {
        idx = (offset - HASH_H_OFF) / 4u;
        cc->hash_h[idx] = value;
        return MM_TRUE;
    }
    if (offset == HASH_CONTROL_OFF) {
        cc->hash_control = value;
        return MM_TRUE;
    }
    if (offset == HASH_PAD_OFF) {
        cc->hash_pad = value;
        return MM_TRUE;
    }
    if (offset == HASH_PAD_AUTO_OFF) {
        cc->hash_pad_auto = value;
        return MM_TRUE;
    }
    if (offset == HASH_XOR_DIN_OFF) {
        /* Accepted, not acted on */
        return MM_TRUE;
    }
    if (offset == HASH_INIT_STATE_OFF) {
        cc->hash_init_state = value;
        return MM_TRUE;
    }
    if (offset == HASH_SELECT_OFF) {
        /* Accepted, not acted on */
        return MM_TRUE;
    }
    if (offset == HASH_CUR_LEN_0_OFF) {
        cc->hash_cur_len[0] = value;
        return MM_TRUE;
    }
    if (offset == HASH_CUR_LEN_1_OFF) {
        cc->hash_cur_len[1] = value;
        return MM_TRUE;
    }
    if (offset == HASH_SW_RESET_OFF) {
        memset(cc->hash_h, 0, sizeof(cc->hash_h));
        cc->hash_control = 0u;
        cc->hash_pad = 0u;
        cc->hash_cur_len[0] = 0u;
        cc->hash_cur_len[1] = 0u;
        return MM_TRUE;
    }
    if (offset == HASH_ENDIAN_OFF || offset == HASH_PAD_FORCE_OFF) {
        /* Accepted, not acted on */
        return MM_TRUE;
    }

    /* CTL registers */
    if (offset == CTL_CRYPTO_CTL_OFF) {
        cc->crypto_ctl = value;
        return MM_TRUE;
    }
    if (offset == CTL_CONTEXT_ID_OFF) {
        cc->context_id = value;
        return MM_TRUE;
    }

    /* DIN registers */
    if (offset == DIN_SRC_MEM_ADDR_OFF) {
        cc->din_src_addr = value;
        return MM_TRUE;
    }
    if (offset == DIN_SRC_MEM_SIZE_OFF) {
        /* Writing SRC_MEM_SIZE triggers the DMA + cryptographic operation */
        cc->din_src_size = value;
        cc_execute(cc, value);
        return MM_TRUE;
    }
    if (offset == DIN_SW_RESET_OFF) {
        cc->din_src_addr = 0u;
        cc->din_src_size = 0u;
        return MM_TRUE;
    }

    /* DOUT registers */
    if (offset == DOUT_DST_MEM_ADDR_OFF) {
        cc->dout_dst_addr = value;
        return MM_TRUE;
    }
    if (offset == DOUT_DST_MEM_SIZE_OFF) {
        cc->dout_dst_size = value;
        return MM_TRUE;
    }
    if (offset == DOUT_SW_RESET_OFF) {
        cc->dout_dst_addr = 0u;
        cc->dout_dst_size = 0u;
        return MM_TRUE;
    }
    if (offset == DOUT_DOUT_FIFO_EMPTY_OFF || offset == DOUT_DMA_MEM_BUSY_OFF) {
        /* Accepted, not acted on */
        return MM_TRUE;
    }

    /* HOST_RGF registers */
    if (offset == HOST_ICR_OFF) {
        /* W1C: clear corresponding bits in IRR */
        cc->irr &= ~value;
        return MM_TRUE;
    }
    if (offset == HOST_IMR_OFF) {
        cc->imr = value;
        return MM_TRUE;
    }
    if (offset == HOST_ENDIAN_OFF) {
        cc->endianness = value;
        return MM_TRUE;
    }
    if (offset == HOST_POWERDOWN_OFF) {
        /* Power-down sequence: accepted, not acted on */
        return MM_TRUE;
    }

    /* All other registers: silently ignore */
    return MM_TRUE;
}
